Repository: tuthieu/ai_chat
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: ChatGPT Client
vi: Chat cùng ChatGPT

source: New chat
vi: Tạo trò chuyện mới

source: Turn on read aloud
vi: Bật tự động đọc

source: Turn off read aloud
vi: Tắt tự động đọc

source: Change language
vi: Thay đổi ngôn ngữ

source: Delete this chat
vi: Xóa cuộc trò chuyện này

source: Error
vi: Lỗi

# createChatFailed
source: Could not create new chat session in Database
vi: Không thể tạo cuộc trò chuyện trong Database

source: Delete chat {title}
vi: Xóa trò chuyện {title}

# deleteChatFailed
source: Could not delete chat session in Database
vi: Không thể xóa cuộc trò chuyện trong Database

# changeLanguageFailed
source: Could not change language in Database
vi: Không thể thay đổi ngôn ngữ trong Database

# changeReadAloudFailed
source: Could not change read aloud setting in Database
vi: Không thể thay đổi chế độ tự động đọc trong Database

# deleteChatConfirmation
source: Are you sure you want to delete this chat?
vi: Bạn có chắc chắn muốn xóa cuộc trò chuyện này không?

source: Yes
vi: Có

source: No
vi: Không

# createMessageFailed
source: Could not create new message in Database
vi: Không thể tạo tin nhắn trong Database

# retrieveMessagesFailed
source: Could not retrieve messages from Database
vi: Không thể lấy tin nhắn từ Database

# saveAIResponseFailed
source: Could not save AI response in Database
vi: Không thể lưu trả lời AI vào Database

# retrieveAIResponseFailed
source: Could not retrieve AI response from Database
vi: Không thể lấy trả lời AI từ Database

source: Start recording
vi: Bắt đầu ghi âm

source: Stop recording
vi: Dừng ghi âm

source: Me
vi: Tôi

source: Send
vi: Gửi

# enterMessage
source: Enter a message
vi: Nhập tin nhắn

# waitAIResponse
source: Waiting for AI response...
vi: Vui lòng đợi trả lời của AI

# speechNotAvailable
source: Speech recognition is denied, please grant permission on your phone settings
vi: Nhận dạng giọng nói đang bị tắt, vui lòng bật trong cài đặt của thiết bị

source: Start narrator
vi: Đọc tin nhắn

source: Stop narrator
vi: Dừng đọc
